{
  "Load": "\tЕсли вы впервые используете плагин, и у вас нет ранее сохранённых списков, то вам необходимо выполнить следующее: используя кнопку \u0022Загрузить\u0022 добавьте все модели объекта, которые необходимо экспортировать. Если случайно были добавлены лишние файлы, выделите их и нажмите кнопку \u0022Удалить\u0022",
  "Folder": "\tДалее укажите папку для сохранения. Прописать путь можно в ручную или же выбрать папку используя кнопку \u0022Обзор\u0022.",
  "Naming": "\tЗадайте префикс и постфикс, которые будет необходимо добавить в название файлов. Если такой необходимости нет, то оставьте поля пустыми.\n\tВыберите необходимые свойства экспорта. По умолчанию стоят стандартные настройки, с которыми чаще всего работают.",
  "List": "\tСохраните список кнопкой \u0022Сохранить список\u0022 в формате (.txt).\n\tДалее этот список можно будет использовать для повторного экспорта, используя кнопку \u0022Загрузить список\u0022.",
  "Config": "\tСохраните конфигурацию кнопкой \u0022Сохранить список\u0022 в формате (.JSON).\n\tДалее эту конфигурацию можно будет использовать для повторного экспорта, используя кнопку \u0022Загрузить список\u0022.",
  "Start": "\tЗапустите экспорт кнопкой \u0022Запуск\u0022.",
  "DetachTitle": "\tПлагин предназначен для пакетного экспорта отсоединённых моделей.",
  "DetachMid": "\tВыберите режим экспорта:\n1. Все файлы будут помещены в одну папку.\n2. Файлы будут помещены в соответствующие папки, то есть будет произведено обновление пути по маске.",
  "IFCTitle": "\tПлагин предназначен для пакетного экспорта файлов в формат IFC.",
  "LinkTitle": "\tПлагин предназначен для пакетного добавления моделей в качестве Revit ссылок.",
  "Migrate": "\tПлагин предназначен для миграции проекта в новое место с сохранением структуры связей, как внутри папок, так и внутри самих моделей.\n\tОткройте или вставьте ссылку на Json конфиг, который хранит в себе структуру типа Dictionary\u003Cstring, string\u003E,\nгде первый string - текущий путь к файлу, второй - новый путь.\n\tПример:\n\t{ \u0022C:\\oldfile.rvt\u0022: \u0022C:\\newfile.rvt\u0022,}",
  "NWCTitle": "\tПлагин предназначен для пакетного экспорта файлов в формат NWC.",
  "NWCEnd": "\n\t**********************************************\n\n\tЕсли у вас есть несколько сохранённых конфигураций, то можно использовать пакетный экспорт второго уровня.\n\tКнопкой \u0022Загрузить конфиги\u0022 загрузите список (.txt) с путями к конфигурациям в формате (.JSON). Структура списка выглядит следующим образом: \n\tpath\\\\config.json\n\tpath\\\\config2.json\n\tpath\\\\config3.json\n\tКнопкой \u0022Начать\u0022 запустите пакетный экспорт второго уровня, который экспортирует несколько объектов с соответствующими им настройками.",
  "TransmitTitle": "\tПлагин предназначен для пакетной передачи моделей и реализует схожий функционал с плагином \u0022eTransmit\u0022."
}