Repository: alter-sunset/AlterRevitTools
Catalog: BatchExport/Resources/Strings.*.resx
Languages: ru_ru

# Detach.Title
source: Batch export of detached models
ru_ru: Пакетный экспорт отсоединённых моделей

# Base.Header
source: RVT files to be exported
ru_ru: Список RVT файлов для экспорта

# Base.Button.Help.ToolTip
source: Plugin usage help
ru_ru: Справка по работе с плагином

# Base.Button.Help.Content
source: Help
ru_ru: Справка

# Base.ListBox.ToolTip
source: Files list in (.rvt) format
ru_ru: Список файлов в формате (.rvt)

# Base.Button.Load.Content
source: Load
ru_ru: Загрузить

# Base.Button.Load.ToolTip
source: Load (.rvt) files
ru_ru: Загрузить файлы в формате (.rvt)

# Base.Button.LoadList.Content
source: Load list
ru_ru: Загрузить список

# Base.Button.LoadList.ToolTip
source: Load previously saved configuration file in (.json) format
ru_ru: Загрузить сохранённый ранее файл конфигурации в формате (.json)

# Base.Button.SaveList.Content
source: Save list
ru_ru: Сохранить список

# Base.Button.SaveList.ToolTip
source: Save configuration file in (.json) format
ru_ru: Сохранить файл конфигурации в формате (.json)

# Base.Button.Delete.Content
source: Delete
ru_ru: Удалить

# Base.Button.Delete.ToolTip
source: Delete selected files from list
ru_ru: Удалить выбранные файлы из списка

# IFC.Title
source: IFC batch export
ru_ru: Пакетный экспорт IFC

# Base.ResultingFolder
source: Save to folder
ru_ru: Папка для сохранения

# Base.Button.Browse
source: Browse
ru_ru: Обзор

# Link.Title
source: Batch link models
ru_ru: Пакетное добавление связей

# Link.Header
source: List of RVT files to link
ru_ru: Список RVT файлов для добавления

# Migrate.Title
source: Batch migrate models
ru_ru: Пакетная миграция моделей

# Migrate.Button.LoadConfig
source: Load config
ru_ru: Загрузить конфиг

# Base.Button.Start.Content
source: Start
ru_ru: Запуск

# Base.Button.Start.ToolTip
source: Start batch export of current configuration
ru_ru: Запуск пакетного экспорта текущей конфигурации

# Const.WrongScheme
source: Wrong file scheme
ru_ru: Неверная схема файла

# Const.NoTransDataAlert
source: The document doesn't have any transmission data
ru_ru: В модели нет данных класса TransmissionData

# Const.VMBase.NoFiles
source: Couldn't find correct info in the text file
ru_ru: В текстовом файле не было найдено подходящей информации

# Detach.Mask
source: Mask
ru_ru: Маска

# Detach.Change
source: Change
ru_ru: Заменить

# Detach.To
source: To
ru_ru: На

# Detach.Rename
source: Rename files
ru_ru: Переименовать файлы

# Detach.CheckBox.Purge.Content
source: Purge models
ru_ru: Очистить модели

# Detach.CheckBox.Purge.ToolTip
source: Implements the functionality of the "Purge unused" command until complete cleanup (several times)
ru_ru: Реализует функционал команды "Удалить неиспользуемые'" до полной очистки (несколько раз)

# Detach.CheckBox.EmptyView.Content
source: Check models for “empty” view
ru_ru: Проверить модели на "пустой" вид

# Detach.CheckBox.EmptyView.ToolTip
source: Should the “View_name” view be checked for the presence of objects, and if the view is empty, the file will be saved with the prefix “EMPTY_”
ru_ru: Следует ли проверить вид "Имя_вида" на наличие объектов, и если вид пустой - то сохранить файл с префиксом "EMPTY_"

# Detach.ViewName
source: Name of the view to check
ru_ru: Имя вида для проверки

# Base.Button.EraseList
source: Erase list
ru_ru: Удалить список

# Detach.MaskIn
source: 05_WIP
ru_ru: 05_В_Работе\52_ПД

# Detach.MaskOut
source: 06_Common
ru_ru: 06_Общие\62_ПД

# IFC.SpaceBoundaryLevels0
source: None
ru_ru: Нет

# IFC.SpaceBoundaryLevels1
source: 1st Level
ru_ru: Первый уровень

# IFC.SpaceBoundaryLevels2
source: 2nd Level
ru_ru: Второй уровень

# Const.Default
source: Default
ru_ru: По умолчанию

# Base.Prefix
source: Prefix
ru_ru: Префикс названия

# Base.Prefix.ToolTip
source: Prefix to be added to the start of a file name
ru_ru: Префикс, который необходимо вставить перед названием файла

# Base.Postfix
source: Postfix
ru_ru: Постфикс названия

# Base.Postfix.ToolTip
source: Postfix to be added to the end of a file name
ru_ru: Постфикс, который необходимо вставить после названия файла

# IFC.MappingTable
source: Export parameter mapping table
ru_ru: Таблица соответствия параметров экспорта

# IFC.BaseQuantities
source: Export base quantities
ru_ru: Экспорт основных величин

source: IFC version
ru_ru: Версия IFC

# IFC.CheckBox.Splitting
source: Split Walls, Columns, Ducts by Level
ru_ru: Разделить стены, колонны и воздуховоды по уровню

# Base.ExportScopeWhole
source: Export entire model
ru_ru: Экспортировать весь проект

# Base.ExportScopeView
source: Export view
ru_ru: Экспортировать вид

# Base.IgnoreMissingView
source: Ignore missing view and export whole project
ru_ru: Игнорировать отсутствие вида и экспортировать весь проект

# IFC.SpaceBoundaries
source: Space boundaries
ru_ru: Границы пространств

# Base.WorksetPrefixes
source: Prefixes of Worksets to be closed
ru_ru: Префиксы рабочих наборов, которые нужно закрыть

# Base.WorksetPrefixes.ToolTip
source: Specify the Prefixes of all Worksets that need to be closed when opening the file, separated by semicolons (;). Worksets with Links are usually closed to speed up the opening of models.
ru_ru: Укажите через точку-запятую (;) префиксы всех рабочих наборов, которые необходимо закрыть при открытии файла. Обычно закрывают рабочие наборы со связями, чтобы ускорить открытие моделей.

# Base.TurnOffLog
source: Don't create log file
ru_ru: Не создавать лог-файл

# Const.DiffCoord
source: A difference in coordinate systems has been detected. Do you want to retrieve coordinates from the file?
ru_ru: Обнаружено различие систем координат. Выполнить получение коордианат из файла?

# Const.Link
source: Link
ru_ru: Связь

# Const.Error
source: Error
ru_ru: Ошибка

# Link.Pin
source: Pin Links
ru_ru: Закрепить связи

# Link.CurrentWorkset
source: Add to the current Workset
ru_ru: Добавить в текущий рабочий набор

# NWC.Shared
source: Shared
ru_ru: Общие

# NWC.Internal
source: Project Internal
ru_ru: Внутренние для проекта

# NWC.None
source: None
ru_ru: Нет

# NWC.All
source: All
ru_ru: Все

# NWC.Elements
source: Elements
ru_ru: Объекты

# NWC.Title
source: Batch export NWC
ru_ru: Пакетный экспорт NWC

# NWC.ConvertElementProperties
source: Convert element properties
ru_ru: Конвертировать свойства объекта

# NWC.Coordinates
source: Coordinates
ru_ru: Координаты

# NWC.DivideFile
source: Divide File into Levels
ru_ru: Разделить файл на уровни

# NWC.ExportElementIds
source: Export element Ids
ru_ru: Экспортировать Id элементов

# NWC.ExportLinks
source: Convert linked files
ru_ru: Экспортировать связанные файлы

# NWC.ExportParts
source: Convert construction parts
ru_ru: Экспортировать элементы конструкции

# NWC.ExportRoomAsAttr
source: Convert room as attribute
ru_ru: Экспортировать помещение как атрибут

# NWC.ExportRoomGeometry
source: Export room geometry
ru_ru: Экспортировать геометрию помещений

# NWC.FindMissingMaterials
source: Try and find missing material
ru_ru: Проверять и находить отсутсвующие материалы

# NWC.ConvertElementParams
source: Convert element parameters
ru_ru: Конвертировать параметры объектов

# NWC.ExportURLs
source: Convert URLs
ru_ru: Экспортировать URL адреса

# NWC.ExportCAD
source: Convert linked CAD formats
ru_ru: Экспортировать связанные файлы САПР

# NWC.ConvertLights
source: Convert lights
ru_ru: Экспортировать источники света

# NWC.Faceting
source: Faceting Factor
ru_ru: Коэффициент фасетизации

# NWC.ListConfigs
source: LIst of JSON configs
ru_ru: Список JSON конфигов

# NWC.ListConfigs.ToolTip
source: List of configuration files
ru_ru: Список файлов конфигураций

# NWC.Button.LoadConfigs
source: Load configs
ru_ru: Загрузить конфиги

# NWC.Button.LoadConfigs.ToolTip
source: Load list with configuration files in (.txt) format
ru_ru: Загрузить список с файлами конфигураций в формате (.txt)

# NWC.Button.Begin
source: Begin
ru_ru: Начать

# NWC.Button.Begin.ToolTip
source: Begin export of multiple configurations
ru_ru: Запустить экспорт нескольких конфигураций

# Params.Title
source: Batch export parameters
ru_ru: Пакетный экспорт параметров

# Params.Header
source: LIst of RVT files to process
ru_ru: Список RVT файлов для обработки

# Params.ResultFile
source: Path to resulting file
ru_ru: Путь к выходному файлу

# Params.ResultFile.ToolTip
source: Define path to the resulting file in (.csv) format
ru_ru: Укажите путь к выходному файлу формата .csv

# Params.ExportParams
source: Parameters to export
ru_ru: Параметры для экспорта

# Params.ExportParams.ToolTip
source: Specify the names of the parameters to be exported using a semicolon (;).
ru_ru: Укажите через точку-запятую (;) имена параметров, которые необходимо экспортировать.

# Params.FamilyAndType
source: Family and Type
ru_ru: Семейство и типоразмер

# Const.DefaultParams
source: Level;Assembly Code;Count
ru_ru: ADSK_Этаж;ADSK_Номер здания;ADSK_Комплект чертежей;

# Transmit.Title
source: Batch export of transmitted models
ru_ru: Пакетный экспорт передаваемых моделей

# Transmit.SameFolder
source: Put everything in single folder
ru_ru: Всё в одной папке

# Const.FilterTxt
source: Text file (.txt)|*.txt
ru_ru: Текстовый файл (.txt)|*.txt

# Const.FilterJson
source: JSON file (.json)|*.json
ru_ru: Файл JSON (.json)|*.json

# Const.FilterRvt
source: Revit Files (.rvt)|*.rvt
ru_ru: Файлы Revit (.rvt)|*.rvt

# Const.FilterCsv
source: (CSV) split by semicolon (.csv)|*.csv
ru_ru: (CSV) разделитель точка с запятой (.csv)|*.csv

# Const.RemoveLinks
source: Remove all Links
ru_ru: Удалить все связи

# Const.OpenWorksets
source: Open Worksets
ru_ru: Открыть Рабочие наборы

# Const.Purge
source: Purge unused
ru_ru: Удалить неиспользуемые

# Const.RemoveEmptyWorksets
source: Remove empty Worksets
ru_ru: Удалить пустые рабочие наборы

# Const.GoodEvening
source: Good evening
ru_ru: Добрый вечер

# Const.Done
source: Done!
ru_ru: Готово!

# Const.Detached
source: _detached
ru_ru: _отсоединено

# Const.NoFolder
source: Specify the folder for export!
ru_ru: Укажите папку для экспорта!

# Const.WrongFolder
source: Specify valid folder for export!
ru_ru: Укажите корректную папку для экспорта!

# Const.CreateFolder
source: No such folder exists. Should I create one?
ru_ru: Такой папки не существует. Создать папку?

# Const.ToHell
source: Well, the call is yours.
ru_ru: Нет, так нет. Тогда живи в проклятом мире, который сам и создал.

# Const.NoFiles
source: Add at least one file for export!
ru_ru: Добавьте хотя бы один файл для экспорта!

# Const.NoViewName
source: Enter View name
ru_ru: Введите имя вида!

# Const.NoPathMode
source: Select the Path mode!
ru_ru: Выберите режим выбора пути!

# Const.NoMaskPath
source: Specify the path replacement mask!
ru_ru: Укажите маску замены пути!

# Const.WrongMask
source: Inconsistency between the input mask and file names!
ru_ru: Несоответствие входной маски и имён файлов!

# Const.NoMaskFile
source: Enter a mask for renaming files!
ru_ru: Введите маску для переименования файлов!

# Const.NoCsv
source: Specify the valid path to the output file!
ru_ru: Укажите корректный путь к выходному файлу!

# Const.NoParameters
source: Specify at least one parameter for export!
ru_ru: Укажите хотя бы один параметр для экспорта!

# Const.TaskCompleted
source: Task completed.
ru_ru: Задание выполнено.

# Migrate.NoConfig
source: Provide path to the configuration!
ru_ru: Предоставьте ссылку на конфиг!

# Migrate.DidntCopy
source: These files weren't copied:
ru_ru: Следующие файлы не были скопированы:

# NWC.AddConfigs
source: Add configs!
ru_ru: Добавьте конфиги!

# Const.TotalTime
source: Total time:
ru_ru: Всего затрачено времени:

# Const.ThereWhere
source: There where
ru_ru: В процессе выполнения было

# Const.Errors
source: errors.
ru_ru: ошибок.

# Help.Load
source: If you are using the plugin for the first time and do not have any previously saved lists, you need to do the following: use the “Load” button to add all the object models that need to be exported. If you accidentally added extra files, select them and click the “Delete” button.
ru_ru: Если вы впервые используете плагин, и у вас нет ранее сохранённых списков, то вам необходимо выполнить следующее: используя кнопку "Загрузить" добавьте все модели объекта, которые необходимо экспортировать. Если случайно были добавлены лишние файлы, выделите их и нажмите кнопку "Удалить"

# Help.Folder
source: Next, specify the folder for saving. You can enter the path manually or select a folder using the “Browse” button.
ru_ru: Далее укажите папку для сохранения. Прописать путь можно в ручную или же выбрать папку используя кнопку "Обзор".

# Help.Naming
source: Set the prefix and postfix that you want to add to the file names. If you don't need to do this, just leave the fields blank. Select the export properties you need. The default settings are the ones that are used most often.
ru_ru: Задайте префикс и постфикс, которые будет необходимо добавить в название файлов. Если такой необходимости нет, то оставьте поля пустыми. Выберите необходимые свойства экспорта. По умолчанию стоят стандартные настройки, с которыми чаще всего работают.

# Help.List
source: Save the list by clicking the “Save list” button in (.txt) format. This list can then be used for re-exporting by clicking the “Load list” button.
ru_ru: Сохраните список кнопкой "Сохранить список" в формате (.txt). Далее этот список можно будет использовать для повторного экспорта, используя кнопку "Загрузить список".

# Help.Config
source: Save the configuration by clicking the “Save config” button in (.JSON) format. This configuration can then be used for re-exporting by clicking the “Load config” button.
ru_ru: Сохраните конфигурацию кнопкой "Сохранить конфиг" в формате (.JSON). Далее эту конфигурацию можно будет использовать для повторного экспорта, используя кнопку "Загрузить конфиг".

# Help.Start
source: Start the export by clicking the “Start” button.
ru_ru: Запустите экспорт кнопкой "Запуск".

# Help.DetachTitle
source: The plugin is designed for batch export of detached models.
ru_ru: Плагин предназначен для пакетного экспорта отсоединённых моделей.

# Help.DetachMid
source: Select the export mode: 1. All files will be placed in one folder. 2. Files will be placed in the appropriate folders, i.e., the path will be updated according to the mask.
ru_ru: Выберите режим экспорта: 1. Все файлы будут помещены в одну папку. 2. Файлы будут помещены в соответствующие папки, то есть будет произведено обновление пути по маске.

# Help.IFCTitle
source: The plugin is designed for batch export of files to IFC format.
ru_ru: Плагин предназначен для пакетного экспорта файлов в формат IFC.

# Help.LinkTitle
source: The plugin is designed for batch adding models as Revit links.
ru_ru: Плагин предназначен для пакетного добавления моделей в качестве Revit ссылок.

# Help.Migrate
source: The plugin is designed to migrate a project to a new location while preserving the structure of links, both within folders and within the models themselves. Open or paste a link to the Json config, which stores the structure of type Dictionary<string, string>, where the first string is the current path to the file, and the second is the new path. Example: { “C:\oldfile.rvt”: “C:\newfile.rvt”,}
ru_ru: Плагин предназначен для миграции проекта в новое место с сохранением структуры связей, как внутри папок, так и внутри самих моделей. Откройте или вставьте ссылку на Json конфиг, который хранит в себе структуру типа Dictionary<string, string>, где первый string - текущий путь к файлу, второй - новый путь. Пример: { "C:\oldfile.rvt": "C:\newfile.rvt",}

# Help.NWCTitle
source: The plugin is designed for batch exporting files to NWC format.
ru_ru: Плагин предназначен для пакетного экспорта файлов в формат NWC.

# Help.NWCEnd
source: ********************************************** If you have several saved configurations, you can use the second-level batch export. Use the “Load Configs” button to load a list (.txt) with paths to configurations in (.JSON) format. The list structure looks like this: path\\config.json path\\config2.json path\\config3.json Use the “Begin” button to start the second-level batch export, which exports several objects with their corresponding settings.
ru_ru: ********************************************** Если у вас есть несколько сохранённых конфигураций, то можно использовать пакетный экспорт второго уровня. Кнопкой "Загрузить конфиги" загрузите список (.txt) с путями к конфигурациям в формате (.JSON). Структура списка выглядит следующим образом: path\\config.json path\\config2.json path\\config3.json Кнопкой "Начать" запустите пакетный экспорт второго уровня, который экспортирует несколько объектов с соответствующими им настройками.

# Help.TransmitTitle
source: The plugin is designed for batch transfer of models and implements similar functionality to the “eTransmit” plugin.
ru_ru: Плагин предназначен для пакетной передачи моделей и реализует схожий функционал с плагином "eTransmit".

# Help.ParamsTitle
source: The plugin is designed for batch export of parameters from the model to a .csv file. Specify the names of the parameters to be exported, separated by semicolon (;) in the corresponding field.
ru_ru: Плагин предназначен для пакетного эскпорта параметров из модели в файл формата .csv. Укажите наименования параметров, которые необходимо экспортировать, через точку-запятую (;) в соответсвующее поле.

# Core.Panel.Export
source: Batch export
ru_ru: Пакетный экспорт

# Core.Panel.Import
source: Batch import
ru_ru: Пакетный импорт

# Core.Button.NWC.Text
source: NWC Export
ru_ru: Экспорт NWC

# Core.Button.IFC.Text
source: IFC Export
ru_ru: Экспорт IFC

# Core.Button.Detach.Text
source: Detached models Export
ru_ru: Экспорт отсоединённых моделей

# Core.Button.Transmit.Text
source: Transmit models
ru_ru: Передача моделей

# Core.Button.Migrate.Text
source: Migrate models
ru_ru: Миграция моделей

# Core.Button.Params.Text
source: Parameters Export
ru_ru: Экспорт параметров

# Core.Button.Link.Text
source: Link RVT models
ru_ru: Добавление Revit ссылок

# Core.Button.Worksets.Text
source: Worksets Export
ru_ru: Экспорт рабочих наборов

# Core.Button.NWC.ToolTip
source: Batch export models to NWC
ru_ru: Пакетный экспорт в NWC

# Core.Button.IFC.ToolTip
source: Batch export models to IFC
ru_ru: Пакетный экспорт в IFC

# Core.Button.Detach.ToolTip
source: Batch detach and export models
ru_ru: Пакетный экспорт отсоединённых моделей

# Core.Button.Transmit.ToolTip
source: Batch transmit models
ru_ru: Пакетная передача моделей

# Core.Button.Migrate.ToolTip
source: Batch migrate models and update nested links
ru_ru: Пакетная миграция моделей с обновлением связей

# Core.Button.Params.ToolTip
source: Batch export parameters from models into single CSV
ru_ru: Пакетный экспорт параметров из моделей в единый CSV файл

# Core.Button.Link.ToolTip
source: Link batch of RVT models to current project in one click
ru_ru: Пакетное добавление Revit ссылок в текущую модель

# Core.Button.Worksets.ToolTip
source: Batch export workset name from several models
ru_ru: Пакетный экспорт рабочих наборов из моделей
